package com.team6.sole.domain.home.model;

public enum Region {
    S00,    // 서울 전체
    S01,    // 강남구
    S02,    // 강동구
    S03,    // 강북구
    S04,    // 강서구
    S05,    // 관악구
    S06,    // 광진구
    S07,    // 구로구
    S08,    // 금천구
    S09,    // 노원구
    S10,    // 도봉구
    S11,    // 동대문구
    S12,    // 동작구
    S13,    // 마포구
    S14,    // 서대문구
    S15,    // 서초구
    S16,    // 성동구
    S17,    // 성북구
    S18,    // 송파구
    S19,    // 양천구
    S20,    // 영등포구
    S21,    // 용산구
    S22,    // 은평구
    S23,    // 종로구
    S24,    // 중구
    S25,    // 중랑구

    B00,    // 부산 전체
    B01,    // 강서구
    B02,    // 금정구
    B03,    // 기장군
    B04,    // 남구
    B05,    // 동구
    B06,    // 동래구
    B07,    // 부산진구
    B08,    // 북구
    B09,    // 사상구
    B10,    // 사하구
    B11,    // 서구
    B12,    // 수영구
    B13,    // 연제구
    B14,    // 영도구
    B15,    // 중구
    B16,    // 해운대구

    D00,    // 대구 전체
    D01,    // 남구
    D02,    // 달서구
    D03,    // 달성군
    D04,    // 동구
    D05,    // 북구
    D06,    // 서구
    D07,    // 수성구
    D08,    // 중구

    I00,    // 인천 전체
    I01,    // 강화군
    I02,    // 계양구
    I03,    // 남동구
    I04,    // 동구
    I05,    // 미추홀구
    I06,    // 부평구
    I07,    // 서구
    I08,    // 연수구
    I09,    // 옹진군
    I10,    // 중구

    G00,    // 광주 전체
    G01,    // 광산구
    G02,    // 남구
    G03,    // 동구
    G04,    // 북구
    G05,    // 서구

    DJ00,    // 대전 전체
    DJ01,    // 대덕구
    DJ02,    // 동구
    DJ03,    // 서구
    DJ04,    // 유성구
    DJ05,    // 중구

    U00,    // 울산 전체
    U01,    // 남구
    U02,    // 동구
    U03,    // 북구
    U04,    // 울주군
    U05,    // 중구

    SGG,    // 세종 전체

    K00,    // 경기 전체
    K01,    // 가평군
    K02,    // 고양시
    K03,    // 과천시
    K04,    // 광명시
    K05,    // 광주시
    K06,    // 구리시
    K07,    // 군포시
    K08,    // 김포시
    K09,    // 남양주시
    K10,    // 동두천시
    K11,    // 부천시
    K12,    // 성남시
    K13,    // 수원시
    K14,    // 시흥시
    K15,    // 안산시
    K16,    // 안성시
    K17,    // 안양시
    K18,    // 양주시
    K19,    // 양평군
    K20,    // 여주시
    K21,    // 연천군
    K22,    // 오산시
    K23,    // 용인시
    K24,    // 의왕시
    K25,    // 의정부시
    K26,    // 이천시
    K27,    // 파주시
    K28,    // 평택시
    K29,    // 포천시
    K30,    // 하남시
    K31,    // 화성시

    KW00,    // 강원 전체
    KW01,    // 강릉시
    KW02,    // 고성군
    KW03,    // 동해시
    KW04,    // 삼척시
    KW05,    // 속초시
    KW06,    // 양구군
    KW07,    // 양양군
    KW08,    // 영월군
    KW09,    // 원주시
    KW10,    // 인제군
    KW11,    // 정선군
    KW12,    // 철원군
    KW13,    // 춘천시
    KW14,    // 태백시
    KW15,    // 평창군
    KW16,    // 홍천군
    KW17,    // 화천군
    KW18,    // 횡성군

    CB00,    // 충북 전체
    CB01,    // 괴산군
    CB02,    // 단양군
    CB03,    // 보은군
    CB04,    // 영동군
    CB05,    // 옥천군
    CB06,    // 음성군
    CB07,    // 제천시
    CB08,    // 증평군
    CB09,    // 진천군
    CB10,    // 청주시
    CB11,    // 충주시

    CN00,    // 충남 전체
    CN01,    // 계룡시
    CN02,    // 공주시
    CN03,    // 금산군
    CN04,    // 논산시
    CN05,    // 당진시
    CN06,    // 보령시
    CN07,    // 부여군
    CN08,    // 서산시
    CN09,    // 서천군
    CN10,    // 아산시
    CN11,    // 예산군
    CN12,    // 천안시
    CN13,    // 청양군
    CN14,    // 태안군
    CN15,    // 홍성군

    JB00,    // 전북 전체
    JB01,    // 고창군
    JB02,    // 군산시
    JB03,    // 김제시
    JB04,    // 남원시
    JB05,    // 무주군
    JB06,    // 부안군
    JB07,    // 순창군
    JB08,    // 완주군
    JB09,    // 익산시
    JB10,    // 임실군
    JB11,    // 장수군
    JB12,    // 전주시
    JB13,    // 정읍시
    JB14,    // 진안군

    JN00,    // 전남 전체
    JN01,    // 강진군
    JN02,    // 고흥군
    JN03,    // 곡성군
    JN04,    // 광양시
    JN05,    // 구례군
    JN06,    // 나주시
    JN07,    // 담양군
    JN08,    // 목포시
    JN09,    // 무안군
    JN10,    // 보성군
    JN11,    // 순천시
    JN12,    // 신안군
    JN13,    // 여수시
    JN14,    // 영광군
    JN15,    // 영암군
    JN16,    // 완도군
    JN17,    // 장성군
    JN18,    // 장흥군
    JN19,    // 진도군
    JN20,    // 함평군
    JN21,    // 해남군
    JN22,    // 화순군

    GB00,    // 경북 전체
    GB01,    // 경산시
    GB02,    // 경주시
    GB03,    // 고령군
    GB04,    // 구미시
    GB05,    // 군위군
    GB06,    // 김천시
    GB07,    // 문경시
    GB08,    // 봉화군
    GB09,    // 상주시
    GB10,    // 성주군
    GB11,    // 안동시
    GB12,    // 영덕군
    GB13,    // 영양군
    GB14,    // 영주시
    GB15,    // 영천시
    GB16,    // 예천군
    GB17,    // 울릉군
    GB18,    // 울진군
    GB19,    // 의성군
    GB20,    // 청도군
    GB21,    // 청송군
    GB22,    // 칠곡군
    GB23,    // 포항시

    GN00,    // 경남 전체
    GN01,    // 거제시
    GN02,    // 거창군
    GN03,    // 고성군
    GN04,    // 김해시
    GN05,    // 남해군
    GN06,    // 밀양시
    GN07,    // 사천시
    GN08,    // 산청군
    GN09,    // 양산시
    GN10,    // 의령군
    GN11,    // 진주시
    GN12,    // 창녕군
    GN13,    // 창원시
    GN14,    // 통영시
    GN15,    // 하동군
    GN16,    // 함안군
    GN17,    // 함양군
    GN18,    // 합천군

    JJ00,    // 제주 전체
    JJ01,    // 서귀포시
    JJ02,    // 제주시
}
